##### Reading CSE 101 OBE Marksheet

Evaluation ID, Student_Enrollment, Assessments ID, Obtain Marks

In [1]:
import pandas as pd
file = pd.read_excel('CSE104 OBE Mark Sheet.xlsx')

In [2]:
file.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Final Total,Final Total Converted,Project Work,Project Work Total,Total,Unnamed: 22,CO Total,Unnamed: 24,Unnamed: 25,Unnamed: 26
0,NaN,NaN,NaN,NaN,NaN,CO1,CO1,CO1,CO2,CO1,...,100.0,40.0,CO4,30.0,100.0,NaN,CO1,CO2,CO3,CO4
1,NaN,NaN,NaN,NaN,NaN,Q1,Q2,Q3,Q4,Q5,...,NaN,NaN,Lab,NaN,NaN,NaN,165,35,50,30
2,NaN,NaN,NaN,NaN,NaN,25,25,30,20,30,...,NaN,NaN,30,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,1416455.0,CSE104,1.0,Summer,15,0,5,15,2,...,65.0,26.0,24,24.0,67.0,8.2,55,26,28,24
4,2.0,1579288.0,CSE104,1.0,Summer,0,0,18,0,5,...,46.0,18.4,23,23.0,57.0,8.6,45,13,23,23

In [3]:
# Taking columns for Q1
mid_q1 = file.iloc[3:, :6]
mid_q1.head()

   Serial         ID Course ID  Section  Semester Midterm
3     1.0  1416455.0    CSE104       1.0   Summer      15
4     2.0  1579288.0    CSE104       1.0   Summer       0
5     3.0  1528882.0    CSE104       3.0   Summer      15
6     4.0  1653725.0    CSE104       3.0   Summer       0
7     5.0  1625654.0    CSE104       1.0   Summer       5

In [4]:
# Dropping 2 columns as we needed 4 columns 
q1 = mid_q1.drop(mid_q1.columns[[2,3]], axis= 1)
q1.head()

   Serial         ID Semester Midterm
3     1.0  1416455.0   Summer      15
4     2.0  1579288.0   Summer       0
5     3.0  1528882.0   Summer      15
6     4.0  1653725.0   Summer       0
7     5.0  1625654.0   Summer       5

In [5]:
# Cnverting q1 as a list
midterm_q1_l = q1.values.tolist()
print(midterm_q1_l[1])

[2.0, 1579288.0, 'Summer', 0]

In [6]:
# To get question no. for assessments ID
to_list = file.values.tolist()
question_no = to_list[1:][0][5]
print("Question number is: ",question_no)

Question number is:  Q1

In [7]:
print(midterm_q1_l[3])

[4.0, 1653725.0, 'Summer', 0]

In [8]:
for i in range(len(midterm_q1_l)):
    midterm_q1_l[i][0] = 20000 + i
    midterm_q1_l[i][1] = 2000 + i
    midterm_q1_l[i][2] = 'CSE104_Mid_' + question_no   # As our assessments ID named like this
    
print(midterm_q1_l[1])

[20001, 2001, 'CSE104_Mid_Q1', 0]

In [9]:
# Converting list dataframe
df = pd.DataFrame(midterm_q1_l,columns=['Evaluation ID', 'Student_Enrollment', 'Assessments ID', 'Obtain Marks'] )
df.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0          20000                2000  CSE104_Mid_Q1            15
1          20001                2001  CSE104_Mid_Q1             0
2          20002                2002  CSE104_Mid_Q1            15
3          20003                2003  CSE104_Mid_Q1             0
4          20004                2004  CSE104_Mid_Q1             5

In [10]:
df.to_excel('evaluation_for_cse104_mid_q1.xlsx')

Evaluation for question 2

In [11]:
# Taking columns for Q2
mid_q2 = file.iloc[3:, :7]
mid_q2.head()

   Serial         ID Course ID  Section  Semester Midterm Unnamed: 6
3     1.0  1416455.0    CSE104       1.0   Summer      15          0
4     2.0  1579288.0    CSE104       1.0   Summer       0          0
5     3.0  1528882.0    CSE104       3.0   Summer      15          7
6     4.0  1653725.0    CSE104       3.0   Summer       0          0
7     5.0  1625654.0    CSE104       1.0   Summer       5         15

In [12]:
# Dropping 3 columns as we needed 4 columns 
q2 = mid_q2.drop(mid_q2.columns[[2,3,4]], axis= 1)
q2.head()

   Serial         ID Midterm Unnamed: 6
3     1.0  1416455.0      15          0
4     2.0  1579288.0       0          0
5     3.0  1528882.0      15          7
6     4.0  1653725.0       0          0
7     5.0  1625654.0       5         15

In [13]:
# Cnverting q2 as a list
midterm_q2_l = q2.values.tolist()
print(midterm_q2_l[1])

[2.0, 1579288.0, 0, 0]

In [14]:
# To get question no. for assessments ID
to_list = file.values.tolist()
question_no = to_list[1:][0][6]         # can be write as funtion
print("Question number is: ",question_no)

Question number is:  Q2

In [15]:
for i in range(len(midterm_q2_l)):
    midterm_q2_l[i][0] = 20000 + 1
    midterm_q2_l[i][1] = 2000 + 1
    midterm_q2_l[i][2] = 'Midterm_' + question_no   # As our assessments ID named like this
    
print(midterm_q2_l[1])

[20001, 2001, 'Midterm_Q2', 0]

In [16]:
# Converting list dataframe
df = pd.DataFrame(midterm_q2_l,columns=['Evaluation ID', 'Student_Enrollment', 'Assessments ID', 'Obtain Marks'] )
df.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0          20001                2001     Midterm_Q2             0
1          20001                2001     Midterm_Q2             0
2          20001                2001     Midterm_Q2             7
3          20001                2001     Midterm_Q2             0
4          20001                2001     Midterm_Q2            15

In [17]:
df.to_excel('evaluation_for_cse104_mid_q2.xlsx')